OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f86j16.h
extern __at(0x0F62) volatile __PMMODELbits_t PMMODELbits;

#define _WAITE0                 0x01
#define _WAITE1                 0x02
#define _WAITM0                 0x04
#define _WAITM1                 0x08
#define _WAITM2                 0x10
#define _WAITM3                 0x20
#define _WAITB0                 0x40
#define _WAITB1                 0x80

//==============================================================================


//==============================================================================
//        PMMODEH Bits

extern __at(0x0F63) __sfr PMMODEH;

typedef union
  {
  struct
    {
    unsigned MODE0              : 1;
    unsigned MODE1              : 1;
    unsigned MODE16             : 1;
    unsigned INCM0              : 1;
    unsigned INCM1              : 1;
    unsigned IRQM0              : 1;
    unsigned IRQM1              : 1;
    unsigned BUSY               : 1;
    };

  struct
    {
    unsigned                    : 3;
    unsigned INCM               : 2;
    unsigned                    : 3;
    };

  struct
    {
    unsigned                    : 5;
    unsigned IRQM               : 2;
    unsigned                    : 1;
    };
  } __PMMODEHbits_t;

extern __at(0x0F63) volatile __PMMODEHbits_t PMMODEHbits;

#define _MODE0                  0x01
#define _MODE1                  0x02
#define _MODE16                 0x04
#define _INCM0                  0x08
#define _INCM1                  0x10
#define _IRQM0                  0x20
#define _IRQM1                  0x40
#define _BUSY                   0x80

//==============================================================================

extern __at(0x0F64) __sfr PMCON;

//==============================================================================
//        PMCONL Bits

extern __at(0x0F64) __sfr PMCONL;

typedef union
  {
  struct
    {
    unsigned RDSP               : 1;
    unsigned WRSP               : 1;
    unsigned BEP                : 1;
    unsigned CS1P               : 1;
    unsigned CS2P               : 1;
    unsigned ALP                : 1;
    unsigned CSF0               : 1;
    unsigned CSF1               : 1;
    };

  struct
    {
    unsigned                    : 6;
    unsigned CSF                : 2;
    };
  } __PMCONLbits_t;

extern __at(0x0F64) volatile __PMCONLbits_t PMCONLbits;

#define _RDSP                   0x01
#define _WRSP                   0x02
#define _BEP                    0x04
#define _CS1P                   0x08
#define _CS2P                   0x10
#define _ALP                    0x20
#define _CSF0                   0x40
#define _CSF1                   0x80

//==============================================================================


//==============================================================================
//        PMCONH Bits

extern __at(0x0F65) __sfr PMCONH;

typedef union
  {
  struct
    {
    unsigned PTRDEN             : 1;
    unsigned PTWREN             : 1;
    unsigned PTBEEN             : 1;
    unsigned ADRMUX0            : 1;
    unsigned ADRMUX1            : 1;
    unsigned PSIDL              : 1;
    unsigned                    : 1;
    unsigned PMPEN              : 1;
    };

  struct
    {
    unsigned                    : 3;
    unsigned ADRMUX             : 2;
    unsigned                    : 3;
    };
  } __PMCONHbits_t;

extern __at(0x0F65) volatile __PMCONHbits_t PMCONHbits;

#define _PTRDEN                 0x01
#define _PTWREN                 0x02
#define _PTBEEN                 0x04
#define _ADRMUX0                0x08
#define _ADRMUX1                0x10
#define _PSIDL                  0x20
#define _PMPEN                  0x80

//==============================================================================

extern __at(0x0F66) __sfr PMDIN1;
extern __at(0x0F66) __sfr PMDIN1L;
extern __at(0x0F67) __sfr PMDIN1H;
extern __at(0x0F68) __sfr PMADDR;
extern __at(0x0F68) __sfr PMADDRL;
extern __at(0x0F68) __sfr PMDOUT1;
extern __at(0x0F68) __sfr PMDOUT1L;

//==============================================================================
//        PMADDRH Bits

extern __at(0x0F69) __sfr PMADDRH;

typedef struct
  {
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned CS1                  : 1;
  unsigned CS2                  : 1;
  } __PMADDRHbits_t;

extern __at(0x0F69) volatile __PMADDRHbits_t PMADDRHbits;

#define _CS1                    0x40
#define _CS2                    0x80

//==============================================================================

extern __at(0x0F69) __sfr PMDOUT1H;

//==============================================================================
//        CMSTAT Bits

extern __at(0x0F6A) __sfr CMSTAT;

typedef struct
  {
  unsigned COUT1                : 1;
  unsigned COUT2                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __CMSTATbits_t;

extern __at(0x0F6A) volatile __CMSTATbits_t CMSTATbits;

#define _COUT1                  0x01
#define _COUT2                  0x02

//==============================================================================


//==============================================================================
//        CMSTATUS Bits

extern __at(0x0F6A) __sfr CMSTATUS;

typedef struct
  {
  unsigned COUT1                : 1;
  unsigned COUT2                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __CMSTATUSbits_t;

extern __at(0x0F6A) volatile __CMSTATUSbits_t CMSTATUSbits;

#define _CMSTATUS_COUT1         0x01
#define _CMSTATUS_COUT2         0x02

//==============================================================================


//==============================================================================
//        SSP2CON2 Bits

extern __at(0x0F6B) __sfr SSP2CON2;

typedef union
  {
  struct
    {
    unsigned SEN                : 1;
    unsigned RSEN               : 1;
    unsigned PEN                : 1;
    unsigned RCEN               : 1;
    unsigned ACKEN              : 1;
    unsigned ACKDT              : 1;
    unsigned ACKSTAT            : 1;
    unsigned GCEN               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned ADMSK1             : 1;
    unsigned ADMSK2             : 1;
    unsigned ADMSK3             : 1;
    unsigned ADMSK4             : 1;
    unsigned ADMSK5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __SSP2CON2bits_t;

